!
"
#
%
&
'
(
)
*
+
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
|
~
«
°
´
·
»
×
ɷ
ε
இ
—
‘
’
“
”
•
…
‿
℃
←
→
↓
∩
≤
⊙
①
②
③
④
⑤
⑥
⑦
⑧
⒈
⒉
⒊
⒋
⒌
⒍
⒎
⒏
⒐
╭
╮
╯
╰
◕
☀
★
☆
☑
♐
♪
✌
✒
✨
❤
、
。
《
》
「
」
『
』
【
】
〜
の
ㅠ
一
丁
七
万
丈
三
上
下
不
与
丐
丑
专
且
世
丘
业
丛
东
丝
丢
两
严
丧
个
丫
中
丰
串
临
丶
丸
丹
为
主
丽
举
久
么
义
之
乌
乎
乏
乐
乔
乖
乘
九
也
习
乡
书
买
乱
乳
乾
了
予
争
事
二
于
亏
云
互
五
亚
些
亞
亡
交
亦
产
亨
享
京
亭
亮
亲
人
亿
什
仁
仅
仆
今
介
仍
从
仔
他
付
仙
代
令
以
仪
们
仰
仲
件
价
任
份
仿
企
伊
伎
伏
休
众
优
伙
会
伞
伟
传
伤
伦
伪
伯
估
伱
伴
伶
伸
似
但
位
低
住
佐
佑
体
何
余
佚
佛
作
你
佣
佩
佬
佳
使
來
例
供
依
侠
侣
侧
侨
侯
便
係
促
俄
俊
俏
俐
俗
保
俞
信
俩
俭
修
俱
俺
俾
個
倍
們
倒
倔
倘
候
借
倩
倪
倲
债
值
倾
假
偏
做
停
健
偶
偷
偿
備
储
催
傲
傷
傻
像
僧
儿
兀
元
兄
充
先
光
克
免
兒
兔
兜
入
內
全
八
公
六
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
内
册
再
冒
写
军
农
冠
冤
冬
冯
冰
冲
决
况
冷
净
准
凉
凌
减
凑
凝
几
凡
凤
凯
凰
凳
凸
凹
出
击
函
刀
分
切
刊
划
列
刘
则
刚
创
初
删
判
別
利
别
刮
到
制
刷
券
刺
刻
剂
前
剑
剧
剩
剪
副
割
劇
力
劝
办
功
加
务
动
助
努
劫
励
劲
劳
劵
势
勃
勇
勋
勒
動
務
募
勤
勺
勾
勿
匀
包
匕
化
北
匙
匣
匵
区
医
十
千
升
午
半
华
协
卓
单
卖
南
博
卜
占
卡
卢
卦
卧
卫
印
危
即
却
卷
卸
卻
厂
厅
历
厉
压
厌
厕
厘
厚
原
厢
厦
厨
厭
厶
去
县
叁
参
參
又
及
友
双
反
发
叔
取
受
变
叛
叠
口
古
句
另
叨
只
叫
叮
可
台
史
右
叶
号
司
叹
叽
吃
各
吆
合
吉
吊
同
名
后
吐
向
吓
吗
君
吞
吟
否
吧
吨
含
听
启
吳
吴
吵
吸
吹
吻
吼
吾
呀
呃
呆
呈
告
呐
呕
呗
员
呛
呜
呢
呦
周
味
呵
呸
呼
命
咁
咋
和
咎
咔
咕
咖
咙
咚
咨
咩
咪
咫
咬
咯
咱
咸
咽
哀
品
哄
哇
哈
响
哎
哑
哒
哗
哟
哥
哦
哩
哪
哭
哲
哼
唇
唉
唐
唔
唠
唤
售
唯
唱
唾
啃
商
啊
問
啡
啤
啥
啦
啧
啪
喂
善
喇
喉
喊
喔
喘
喜
喝
喧
單
喵
喷
喽
嗎
嗒
嗓
嗨
嗮
嗯
嗲
嘅
嘉
嘛
嘞
嘟
嘴
嘻
嘿
噗
噘
噜
噢
器
噩
噬
嚣
嚼
囊
囗
四
回
因
团
囧
园
困
围
囶
固
国
图
圃
圆
圈
國
土
圣
在
圭
地
圳
场
圾
址
均
坎
坏
坐
坑
块
坚
坛
坞
坟
坠
坡
坤
坦
坷
垂
垃
型
垢
垫
埂
埃
埋
城
埔
培
基
堂
堆
堕
堡
堪
場
塌
塑
塔
塞
填
境
墓
墙
增
墟
墨
墩
壁
士
壮
声
壳
壶
处
备
复
夏
夕
外
多
夜
够
夠
夢
大
天
太
夫
央
失
头
夸
夹
夺
奇
奈
奉
奋
奎
奏
奔
奕
奖
套
奚
奢
奥
女
奴
奶
奸
她
好
如
妃
妄
妆
妇
妈
妒
妖
妙
妞
妥
妮
妳
妹
妻
姆
始
姐
姑
姓
委
姜
姣
姥
姨
姻
姿
威
娃
娄
娇
娘
娛
娜
娟
娱
娴
娶
婆
婕
婚
婧
婪
婳
婴
婵
婷
媒
媳
嫁
嫌
嫩
子
孔
孕
字
存
孙
孝
季
孤
学
孩
孰
宁
它
宅
宇
守
安
宋
完
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宫
害
宴
宵
家
容
宽
宾
宿
寂
寄
密
富
寒
寝
寞
察
寳
寵
寸
对
寺
寻
导
寿
封
専
射
将
尊
對
小
尐
少
尔
尖
尘
尚
尜
尝
尤
尬
就
尴
尸
尹
尺
尼
尽
尾
尿
局
层
居
屈
届
屋
屌
屎
屏
屑
展
屙
属
屠
屬
山
屿
岁
岑
岗
岛
岩
岸
峡
峰
崇
崔
崖
巍
川
州
巡
工
左
巧
巨
巩
巫
差
己
已
巴
巷
巻
巾
市
布
帅
帆
师
希
帐
帕
帖
帝
帥
带
席
帮
帶
常
帽
幅
幕
干
平
年
并
幸
幺
幻
幼
幽
广
庄
庆
床
序
库
应
底
庖
店
庙
庚
府
废
度
座
康
庸
廓
廖
延
建
开
异
弃
弄
式
引
弗
弘
弟
张
弥
弦
弯
弱
張
強
弹
强
归
当
录
形
彤
彩
彬
影
役
彻
彼
往
征
径
待
很
徊
律
後
徐
得
徘
御
循
微
德
徹
心
必
忆
忌
忍
忒
志
忘
忙
忠
忧
快
忱
念
忽
怀
态
怎
怒
怕
怖
怜
思
怡
急
性
怨
怪
总
恋
恐
恒
恕
恢
恤
恨
恩
恭
息
恶
恼
悄
悉
悔
悟
悠
患
悦
您
悯
悲
情
惊
惑
惜
惠
惧
惨
惩
惫
惬
惭
惯
惰
想
愁
愈
愉
意
愚
愛
感
愤
愧
愿
慈
慌
慎
慕
慢
慣
慧
慨
慰
慶
憧
憨
憬
憶
憾
懂
懒
懷
戏
成
我
戒
或
战
截
戳
戴
戶
户
房
所
扁
扇
手
才
扎
扑
打
扔
托
扣
执
扩
扫
扬
扭
扮
扰
扶
批
找
承
技
抉
把
抑
抒
抓
投
抗
折
抛
抢
护
报
披
抱
抵
抹
抽
担
拆
拇
拉
拌
拍
拎
拒
拓
拔
拖
拘
招
拜
拟
拢
拥
择
括
拭
拯
拱
拳
拼
拿
持
挂
指
按
挎
挑
挖
挚
挞
挡
挣
挤
挥
挨
振
挺
挽
捅
捉
捍
捎
捏
捐
捕
捞
损
换
捣
捧
捨
据
捱
捷
授
掉
掌
排
掘
探
接
控
推
掩
措
掸
揉
描
提
插
換
握
揩
揭
揮
援
搁
搅
搏
搓
搜
搞
搬
搭
携
摄
摆
摇
摔
摩
摸
撇
撑
撒
撕
撞
播
撮
撰
撼
擅
操
擦
擺
擼
攀
攞
支
收
改
攻
放
政
故
效
敉
敌
敏
救
教
敛
敢
散
敦
敬
数
整
敷
文
斑
斗
料
斜
斤
斥
断
斯
新
方
於
施
旁
旅
旋
族
旗
无
既
日
旦
旧
早
旬
旭
旱
时
旺
旻
昂
昆
昊
昌
明
昏
易
昕
星
映
春
昨
昭
是
昵
昶
显
時
晃
晋
晒
晓
晕
晗
晚
晨
普
景
晰
晴
晶
智
暁
暂
暑
暖
暗
暨
暮
暴
曙
曜
曝
曰
曲
曳
更
曹
曺
曼
曾
替
最
會
月
有
朋
服
朗
望
朝
期
木
未
末
本
术
朱
朴
朵
机
杀
杂
权
杆
杉
李
材
村
杜
束
条
来
杨
杭
杯
杰
東
杵
松
板
极
构
枉
析
枕
林
枚
果
枝
枣
枪
枫
枯
架
某
柑
染
柔
柚
柜
柠
查
柯
柳
柴
査
柿
标
树
校
样
核
根
格
栽
桃
框
案
桌
桐
桓
档
桥
桦
桩
梁
梅
梦
梭
梯
械
梳
检
棄
棉
棋
棍
棒
棕
森
棵
椅
椎
椒
椰
楂
楚
楞
楼
概
榄
榆
榕
榛
榜
榴
槍
槽
樂
模
樣
横
樱
橄
橘
橙
機
橡
檐
檬
欠
次
欢
欣
欧
欲
欺
款
歆
歇
歌
歡
止
正
此
步
武
歲
歷
歸
歹
歺
死
殇
殉
残
段
毁
毅
母
每
毒
比
毕
毙
毛
毫
氏
民
氓
气
氛
氢
氣
氧
水
永
汁
求
汇
汉
汗
江
池
污
汤
汨
汪
汽
沁
沃
沈
沉
沒
沙
沟
没
沥
沫
河
沵
油
治
沾
沿
泄
泉
法
泡
波
泥
注
泪
泮
泰
泳
泸
泻
泼
泽
洁
洋
洒
洗
洛
津
洪
洲
活
派
流
浅
浇
浊
测
济
浏
浑
浒
浓
浙
浦
浩
浪
浮
海
浸
涂
消
涉
涌
涛
涟
涤
润
涧
涨
涯
液
涵
淀
淇
淋
淌
淘
淚
淡
淰
深
混
淹
添
淼
清
渊
渍
渐
渔
減
渡
渣
温
港
渴
游
渺
湖
湘
湧
湾
湿
溃
溅
源
溜
溢
溪
溶
滋
滑
滕
滚
滞
满
滤
滥
滨
滩
滴
漂
漏
漓
演
漠
漪
漫
漱
漾
潇
潜
潞
潭
潮
潼
澀
澈
澜
澡
澳
激
瀚
灌
灣
火
灬
灭
灯
灰
灵
灶
灾
灿
炉
炎
炒
炖
炜
炫
炮
炷
炸
点
為
炼
烂
烈
烛
烟
烤
烦
烧
烫
热
烹
焉
焖
無
焦
焯
焰
焱
然
煌
煎
煞
照
煮
煽
熄
熊
熔
熙
熟
熬
燃
燒
燕
燥
爆
爪
爬
爱
父
爷
爸
爹
爽
片
版
牌
牙
牛
牢
牧
物
牲
牵
特
犇
犬
犯
状
犹
狂
狐
狗
狙
狠
独
狭
狮
狱
狸
狼
猎
猛
猜
猥
猪
猫
献
猴
猿
獣
獲
玄
率
玉
王
玛
玩
玫
玮
环
现
玲
珂
珉
珊
珍
珠
班
現
球
琅
理
琉
琍
琐
琦
琪
琳
琴
琼
瑚
瑜
瑞
瑟
瑰
瑶
璃
璐
瓜
瓣
瓦
瓶
甄
甘
甚
甜
生
用
甩
田
由
申
电
男
甸
画
畅
界
畔
留
畜
略
番
當
疏
疑
疗
疙
疡
疯
疲
疼
疾
病
症
痒
痕
痘
痛
痞
痴
痹
瘦
瘩
瘾
癫
登
發
白
百
皂
的
皆
皇
皮
皱
盆
盈
益
盎
盐
监
盒
盖
盗
盘
盛
盟
目
盯
盲
直
相
盼
盾
省
眉
看
眞
真
眠
眦
眷
眸
眺
眼
着
睁
睇
睐
睛
睡
督
睫
睿
瞌
瞎
瞧
瞬
矛
矜
矣
知
矫
短
矮
石
码
砂
研
破
砸
础
硅
硕
硝
硬
确
硼
碌
碍
碎
碑
碗
碘
碟
碧
碰
碳
磊
磨
磷
示
礼
社
祈
祖
祝
神
祠
祥
票
禁
禅
福
禮
离
禽
禾
秀
私
秋
种
科
秒
秘
租
秤
秦
积
称
移
稀
程
稍
税
稚
稠
稳
穆
穎
穗
穴
究
穷
穹
空
穿
突
窗
窝
窥
立
站
竞
竟
章
童
竭
端
竹
笋
笑
笔
笨
第
笼
等
筋
筒
答
策
筛
筷
筹
签
简
算
管
箱
箴
篇
篮
簋
簽
籍
米
类
粉
粒
粗
粥
粪
粹
精
糊
糕
糖
糙
糟
系
紅
素
索
紧
紫
累
細
終
絕
給
經
綠
網
綸
緣
總
繁
續
纠
红
纤
约
级
纪
纯
纱
纲
纳
纵
纷
纸
纹
纺
纽
线
练
组
细
织
终
绊
绍
绎
经
绑
结
绕
绘
给
绚
络
绝
统
继
绩
绪
续
维
绵
综
绽
绿
缀
缓
编
缘
缚
缠
缤
缩
缴
缸
缺
罄
罐
网
罗
罚
罢
罪
置
羊
美
羔
羞
羡
群
羯
羽
翁
翅
翎
習
翔
翠
翻
翼
耀
老
考
者
而
耍
耐
耗
耳
耶
耻
耽
耿
聊
职
联
聖
聚
聪
肆
肇
肉
肌
肖
肚
肝
肠
股
肢
肤
肥
肩
肪
肯
育
肴
肺
肾
肿
胀
胃
胆
背
胖
胜
胡
胥
胸
能
脂
脆
脉
脏
脑
脖
脚
脫
脱
脸
脾
腋
腌
腐
腔
腥
腩
腰
腹
腻
腾
腿
膏
膜
膽
臂
臆
臣
臨
自
臭
至
致
與
舌
舍
舒
舜
舞
舟
航
般
舰
舱
船
良
艰
色
艳
艹
艺
艾
节
芃
芒
芙
芜
芝
芦
芬
芭
花
芳
芹
苍
苏
苗
苛
若
苦
英
苹
茁
范
茄
茏
茜
茨
茫
茵
茶
草
荐
荔
荚
荡
荣
荧
荭
药
荷
莉
莓
莞
莫
莱
莲
获
莹
菇
菊
菌
菜
華
菲
萃
萌
萍
萎
萝
营
萧
萬
萱
落
葉
著
董
葩
葬
葭
葱
葵
蒋
蒙
蒜
蒡
蒲
蒸
蓄
蓓
蓝
蓬
蔚
蔡
蔬
蔷
蔽
蕉
蕊
蕾
薄
薇
薏
薛
薪
薯
藉
藏
藕
藝
藥
藻
蘸
虎
虐
虑
虔
虚
虫
虹
虽
虾
蚁
蚂
蚊
蚕
蚤
蛋
蛙
蛛
蛮
蜀
蜂
蜕
蜗
蜘
蜜
蜡
蝇
蝎
蝙
蝠
蝥
蝴
蝶
融
螨
蟹
蠡
蠢
血
行
衍
衔
街
衡
衣
补
表
衫
衬
衰
袁
袋
袖
袜
被
袭
裂
装
裕
裙
裡
裤
裳
裸
複
褪
西
要
覃
見
視
覺
觀
见
观
规
觅
视
览
觉
角
解
触
言
討
記
訪
訴
話
該
詹
誉
誌
誓
誤
說
説
誰
講
謝
識
譚
警
變
讓
计
订
认
讨
让
讪
训
议
讯
记
讲
讷
许
论
设
访
诀
证
评
识
诈
诉
诊
词
译
试
诗
诚
话
诞
诠
询
该
详
语
误
诱
说
请
诸
诺
读
课
谁
谂
调
谅
谈
谊
谋
谎
谐
谓
谢
谣
谨
谭
谱
谷
豁
豆
豚
象
豪
豹
貌
貓
財
責
買
賞
賴
贝
负
财
责
贤
败
账
货
质
贩
贪
购
贯
贱
贴
贵
贷
费
贺
贻
贼
赁
资
赋
赌
赏
赖
赚
赛
赞
赠
赡
赢
赤
赫
走
赴
赵
赶
起
趁
超
越
趕
趟
趣
足
跋
跌
跑
距
跟
跨
跪
路
跳
践
跻
踌
踏
踩
踪
踮
蹦
蹭
蹲
躁
躇
身
躲
躺
軟
轉
车
轩
转
轮
软
轰
轻
载
较
辅
辆
辈
辉
输
辖
辗
辛
辞
辟
辣
辩
辰
辱
边
达
迁
迄
迅
过
迈
迎
运
近
返
还
这
进
远
违
连
迟
迪
迫
述
迷
迹
追
退
送
适
逃
逆
选
透
逐
递
途
逗
這
通
逛
逝
速
造
逮
進
逸
逼
遁
遇
運
遍
過
道
遗
遠
遣
遥
遭
遮
遵
選
避
邀
還
邊
邓
邢
那
邦
邮
邱
邵
邻
郁
郊
郎
郑
部
郭
都
鄙
鄭
配
酒
酬
酱
酶
酷
酸
醇
醉
醋
醒
醫
采
释
里
重
野
量
金
針
釨
鉴
銘
錢
錯
鍋
鏡
鑫
针
钉
钓
钙
钟
钢
钥
钰
钱
钻
钾
铁
铃
铅
铣
铭
铮
银
铺
链
销
锁
锅
锈
锋
锐
错
锡
锤
锥
锦
键
锻
镇
镐
镜
镰
长
開
關
门
闪
闭
问
闯
闲
间
闷
闹
闺
闻
闽
阅
阎
阔
队
阱
防
阳
阴
阵
阶
阻
阿
陀
附
际
陆
陈
陌
降
限
院
除
险
陪
陵
陷
隆
随
隐
隔
隘
障
隧
难
雀
雄
雅
集
雇
雕
雖
雜
離
難
雨
雪
雯
雳
零
雷
雾
需
霄
震
霉
霍
霖
霜
霞
露
霸
霹
霾
青
靓
静
非
靠
面
革
靴
鞋
韦
韩
韭
音
頂
頓
頭
页
顶
项
顺
须
顽
顾
顿
预
领
颇
颈
颊
频
颗
题
颜
额
颠
颤
颸
颺
飈
风
飕
飘
飛
飞
食
餐
饞
饭
饮
饰
饱
饲
饺
饼
饿
馅
馆
馈
馋
首
香
馥
馨
马
驰
驱
驳
驴
驶
驻
驼
驾
驿
骁
骂
骆
验
骑
骗
骚
骤
骨
高
鬼
魁
魂
魄
魅
魏
魔
魚
魷
鮮
鱼
鲁
鲅
鲜
鳃
鳖
鴨
鸟
鸡
鸣
鸦
鸭
鹅
鹏
鹤
鹫
鹭
鹰
鹿
麗
麦
麵
麻
麼
麽
黄
黍
黎
黑
黔
默
點
鼎
鼓
鼠
鼻
齐
龄
龈
龙
龟




️
﹏
！
＂
％
＆
（
）
，
．
３
４
５
：
；
＝
？
Ｍ
Ｘ
［
］
｀
～
｡
￥
�
<C_UNK>
<C_PAD>